import java.util.Locale;
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        String[][] nameLatitudeLongitudeOpensCloses =  {
                {"Almost Famous", "43.52755023562406", "26.518606935419914", "08:00", "23:30"},
                {"Soho", "43.5258028565389", "26.522469757107643", "09:00", "00:00"},
                {"Милениум", "43.51910958149257", "26.52075541216495", "09:00", "23:30"},
                {"No Mercy", "43.52173293102872", "26.52226412377693", "21:00", "04:00"},
                {"Enjoy", "43.52552829519936", "26.528079654992204", "08:00", "00:00"},
                {"Бялата къща", "43.524879563629675", "26.522540368484", "07:00", "21:00"},
                {"Хаджи Николов Хан", "43.527419311882305", "26.529784811793945", "10:00", "23:00"},
                {"Ресторант Капитан Блъд", "43.52687371512204", "26.531229493375804", "07:00", "01:00"},
                {"Бар Занзибар", "43.52554377894517", "26.525185704164105", "08:00", "23:00"},
                {"Винарна Абритус", "43.52658131141369", "26.531128698176378", "19:00", "00:00"}
        };


        Scanner scan = new Scanner(System.in);
        System.out.println("Въведете локацията си. ");
        System.out.println("Ширина (в градуси): ");
        double latitude = scan.nextDouble();
        System.out.println("Дължина (в градуси): ");
        double longitude = scan.nextDouble();
        byte option;
        do {
            System.out.println("Изберете опция: СПИСЪК ВСИЧКИ (1), СПИСЪК ОТВОРЕНИ (2), КАРТА (3), ИЗХОД (4)");
             option = scan.nextByte();
             switch (option){
                 case 1:
                 case 2:
                 case 3:
                 case 4:
             }
        }while (option != 4);





    }
}